org/20220116194422-python_provides_an_api_to_other_programming_languages.org
:PROPERTIES:
:ID:       3afe4b27-576f-44a8-b477-7dae2b5d5980
:END:
#+TITLE: Python provides an API to other programming languages
#+CREATED: [2022-01-16 Sun 19:44]
#+LAST_MODIFIED: [2022-01-16 Sun 19:47]

We can interface with pretty much every low-level language that has HPC libraries : Fortran, C, C++, etc. and make it feel like a native python library. Which is good because [[id:6c148b45-66c2-42f9-afe0-76a2df38e8c7][progress is reducing the number of things we need to think about]] and python as glue allows us to only learn one language. I think this has tremendously accelerated the development of machine learning.
