20220116194422-python_provides_an_api_to_other_programming_languages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-30 Tue 22:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python provides an API to other programming languages</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Python provides an API to other programming languages</h1>
<p>
We can interface with pretty much every low-level language that has HPC libraries : Fortran, C, C++, etc. and make it feel like a native python library. Which is good because <a href="20220111194152-progress_is_reducing_the_number_of_things_we_need_to_think_about.html#ID-6c148b45-66c2-42f9-afe0-76a2df38e8c7">progress is reducing the number of things we need to think about</a> and python as glue allows us to only learn one language. I think this has tremendously accelerated the development of machine learning.
</p>

<div id="outline-container-org45d0ccc" class="outline-2">
<h2 id="org45d0ccc">Links to this note</h2>
</div>
</div>
</body>
</html>
